IDEA StatiCa Open Model
CalculationCase Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 load case/combination data
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Detail.Loading.CalculationCase
 IdeaRS.OpenModel.Detail.Loading.LoadCase
 Namespace: IdeaRS.OpenModel.Detail.Loading
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public abstract class CalculationCase : OpenElementId
Public MustInherit Class CalculationCase
	Inherits OpenElementId
public ref class CalculationCase abstract : public OpenElementId
The CalculationCase type exposes the following members.
Constructors
Name | Description
CalculationCase
 constructor
Top
Properties
Name | Description
Id
 Element Id
 (Inherited from OpenElementId.)
IsActive
 active load case/combination
Name
 Gets or set the name
Top
See Also
Reference
IdeaRS.OpenModel.Detail.Loading Namespace